import {numberToChineseWords} from '../index';

test.each([
  [10000, '一万'],
  [20001, '二万零一'],
  [30020, '三万零二十'],
  [40300, '四万零三百'],
  [54000, '五万四千'],
  [65600, '六万五千六百'],
  [55070, '五万五千零七十'],
  [40680, '四万零六百八十'],
  [35008, '三万五千零八'],
  [10101, '一万零一百零一'],
  [20011, '二万零一十一'],
  [100000, '一十万'],
  [100001, '一十万零一'],
  [1000001, '一百万零一'],
  [1030000, '一百零三万'],
  [1300000, '一百三十万'],
  [3004500, '三百万四千五百'],
  [10000001, '一千万零一'],
  [10300000, '一千零三十万'],
  [10200201, '一千零二十万零二百零一'],
  [20034005, '二千零三万四千零五'],
  [23004500, '二千三百万四千五百'],
  [43033039, '四千三百零三万三千零三十九'],
  [40333309, '四千零三十三万三千三百零九'],
  [7000000, '七百万'],
  [80000000, '八千万'],
  [12345678, '一千二百三十四万五千六百七十八'],
  [99999999, '九千九百九十九万九千九百九十九'],
])('integer-10000-99999999', (input: number, expected: string) => {
  expect(numberToChineseWords(input)).toBe(expected);
});
