import {convertNumber} from '../main/index';

test.each([
  [1_0000_0000, '一亿'],
  [2_0000_0001, '二亿零一'],
  [3_0000_0020, '三亿零二十'],
  [4_0000_0300, '四亿零三百'],
  [5_0000_4000, '五亿零四千'],
  [6_0005_0000, '六亿零五万'],
  [7_0060_0000, '七亿零六十万'],
  [8_0700_0000, '八亿零七百万'],
  [9_8000_0000, '九亿八千万'],
  [1_0006_5600, '一亿零六万五千六百'],
  [1_0205_5070, '一亿零二百零五万五千零七十'],
  [4_0000_0680, '四亿零六百八十'],
  [4_0680_0000, '四亿零六百八十万'],
  [3_0000_5008, '三亿零五千零八'],
  [3_5008_0000, '三亿五千零八万'],
  [1_0101_0101, '一亿零一百零一万零一百零一'],
  [2_0000_0011, '二亿零一十一'],
  [10_0000_0000, '一十亿'],
  [10_0000_0001, '一十亿零一'],
  [10_0000_1000, '一十亿零一千'],
  [10_1010_1010, '一十亿一千零一十万一千零一十'],
  [101_0101_0101, '一百零一亿零一百零一万零一百零一'],
  [100_4000_2000, '一百亿四千万二千'],
  [700_0000_0000, '七百亿'],
  [8000_0000_0000, '八千亿'],
  [9876_1234_5678, '九千八百七十六亿一千二百三十四万五千六百七十八'],
  [9999_9999_9999, '九千九百九十九亿九千九百九十九万九千九百九十九'],
])('integer-1_0000_0000-9999_9999_9999', (input: number, expected: string) => {
  expect(convertNumber(input)).toBe(expected);
});
