import {convertNumber} from '../main/index';

test.each([
  [1000_0001, '一千万零一'],
  [1030_0000, '一千零三十万'],
  [1020_0201, '一千零二十万零二百零一'],
  [2003_4005, '二千零三万四千零五'],
  [2300_4500, '二千三百万四千五百'],
  [4303_3039, '四千三百零三万三千零三十九'],
  [4033_3309, '四千零三十三万三千三百零九'],
  [8000_0000, '八千万'],
  [1234_5678, '一千二百三十四万五千六百七十八'],
  [9999_9999, '九千九百九十九万九千九百九十九'],
])('integer-1_0000-9999_9999 - default', (input: number, expected: string) => {
  expect(convertNumber(input)).toBe(expected);
});

test.each([
  [1000_0001, '一千万零一'],
  [1030_0000, '一千零三十万'],
  [1020_0201, '一千零二十万零二百零一'],
  [2003_4005, '二千零三万四千零五'],
  [2300_4500, '二千三百万四千五百'],
  [4303_3039, '四千三百零三万三千零三十九'],
  [4033_3309, '四千零三十三万三千三百零九'],
  [8000_0000, '八千万'],
  [1234_5678, '一千二百三十四万五千六百七十八'],
  [9999_9999, '九千九百九十九万九千九百九十九'],
])(
  'integer-1_0000-9999_9999 - simplified',
  (input: number, expected: string) => {
    expect(convertNumber(input, {useTraditional: false})).toBe(expected);
  }
);

test.each([
  [1000_0001, '一千萬零一'],
  [1030_0000, '一千零三十萬'],
  [1020_0201, '一千零二十萬零二百零一'],
  [2003_4005, '二千零三萬四千零五'],
  [2300_4500, '二千三百萬四千五百'],
  [4303_3039, '四千三百零三萬三千零三十九'],
  [4033_3309, '四千零三十三萬三千三百零九'],
  [8000_0000, '八千萬'],
  [1234_5678, '一千二百三十四萬五千六百七十八'],
  [9999_9999, '九千九百九十九萬九千九百九十九'],
])(
  'integer-1_0000-9999_9999 - traditional',
  (input: number, expected: string) => {
    expect(convertNumber(input, {useTraditional: true})).toBe(expected);
  }
);
