import {numberToChineseWords} from '../main/index';

test.each([
  [100000000, '一亿'],
  [200000001, '二亿零一'],
  [300000020, '三亿零二十'],
  [400000300, '四亿零三百'],
  [500004000, '五亿零四千'],
  [600050000, '六亿零五万'],
  [700600000, '七亿零六十万'],
  [807000000, '八亿零七百万'],
  [980000000, '九亿八千万'],
  [100065600, '一亿零六万五千六百'],
  [102055070, '一亿零二百零五万五千零七十'],
  [400000680, '四亿零六百八十'],
  [406800000, '四亿零六百八十万'],
  [300005008, '三亿零五千零八'],
  [350080000, '三亿五千零八万'],
  [101010101, '一亿零一百零一万零一百零一'],
  [200000011, '二亿零一十一'],
  [1000000000, '一十亿'],
  [1000000001, '一十亿零一'],
  [1000001000, '一十亿零一千'],
  [1010101010, '一十亿一千零一十万一千零一十'],
  [10101010101, '一百零一亿零一百零一万零一百零一'],
  [10040002000, '一百亿四千万二千'],
  [70000000000, '七百亿'],
  [800000000000, '八千亿'],
  [987612345678, '九千八百七十六亿一千二百三十四万五千六百七十八'],
  [999999999999, '九千九百九十九亿九千九百九十九万九千九百九十九'],
])('integer-100000000-999999999999', (input: number, expected: string) => {
  expect(numberToChineseWords(input)).toBe(expected);
});
