import {convertNumber} from '../main/index';

test.each([
  [1_0000, '一万'],
  [2_0001, '二万零一'],
  [3_0020, '三万零二十'],
  [4_0300, '四万零三百'],
  [5_4000, '五万四千'],
  [6_5600, '六万五千六百'],
  [5_5070, '五万五千零七十'],
  [4_0680, '四万零六百八十'],
  [3_5008, '三万五千零八'],
  [1_0101, '一万零一百零一'],
  [2_0011, '二万零一十一'],
  [10_0000, '一十万'],
  [10_0001, '一十万零一'],
  [100_0001, '一百万零一'],
  [103_0000, '一百零三万'],
  [130_0000, '一百三十万'],
  [300_4500, '三百万四千五百'],
  [1000_0001, '一千万零一'],
  [1030_0000, '一千零三十万'],
  [1020_0201, '一千零二十万零二百零一'],
  [2003_4005, '二千零三万四千零五'],
  [2300_4500, '二千三百万四千五百'],
  [4303_3039, '四千三百零三万三千零三十九'],
  [4033_3309, '四千零三十三万三千三百零九'],
  [700_0000, '七百万'],
  [8000_0000, '八千万'],
  [1234_5678, '一千二百三十四万五千六百七十八'],
  [9999_9999, '九千九百九十九万九千九百九十九'],
])('integer-1_0000-9999_9999', (input: number, expected: string) => {
  expect(convertNumber(input)).toBe(expected);
});
