export const data: [number, string[]][] = [
  [10, ['一十', '壹拾', '壹拾']],
  [11, ['一十一', '壹拾壹', '壹拾壹']],
  [12, ['一十二', '壹拾贰', '壹拾貳']],
  [13, ['一十三', '壹拾叁', '壹拾參']],
  [14, ['一十四', '壹拾肆', '壹拾肆']],
  [15, ['一十五', '壹拾伍', '壹拾伍']],
  [16, ['一十六', '壹拾陆', '壹拾陸']],
  [17, ['一十七', '壹拾柒', '壹拾柒']],
  [18, ['一十八', '壹拾捌', '壹拾捌']],
  [19, ['一十九', '壹拾玖', '壹拾玖']],
  [20, ['二十', '贰拾', '貳拾']],
  [22, ['二十二', '贰拾贰', '貳拾貳']],
  [33, ['三十三', '叁拾叁', '參拾參']],
  [44, ['四十四', '肆拾肆', '肆拾肆']],
  [55, ['五十五', '伍拾伍', '伍拾伍']],
  [66, ['六十六', '陆拾陆', '陸拾陸']],
  [77, ['七十七', '柒拾柒', '柒拾柒']],
  [88, ['八十八', '捌拾捌', '捌拾捌']],
  [99, ['九十九', '玖拾玖', '玖拾玖']],
  [90, ['九十', '玖拾', '玖拾']],
];

export const NEGATIVE = {
  SIMPLIFIED: '负',
  TRADITIONAL: '負',
};
export const POSITIVE = '正';
