/* eslint-disable prettier/prettier */
export const data: [number, string[]][] = [
  [0.11, ['一分一厘', '一分一釐', '壹分壹厘', '壹分壹釐']],
  [10.11, ['一十又一分一厘', '一十又一分一釐', '壹拾又壹分壹厘', '壹拾又壹分壹釐']],
  [12.13, ['一十二又一分三厘', '一十二又一分三釐', '壹拾贰又壹分叁厘', '壹拾貳又壹分參釐']],
  [
    10.123456789012,
    [
      //
      '一十又一分二厘三毫四秒五忽六微七纤八沙九尘一渺二漠',
      '一十又一分二釐三毫四秒五忽六微七纖八沙九塵一渺二漠',
      '壹拾又壹分贰厘叁毫肆秒伍忽陆微柒纤捌沙玖尘壹渺贰漠',
      '壹拾又壹分貳釐參毫肆秒伍忽陸微柒纖捌沙玖塵壹渺貳漠',
    ],
  ],

  [
    1.123456789123,
    [
      //
      '一又一分二厘三毫四秒五忽六微七纤八沙九尘一埃二渺三漠',
      '一又一分二釐三毫四秒五忽六微七纖八沙九塵一埃二渺三漠',
      '壹又壹分贰厘叁毫肆秒伍忽陆微柒纤捌沙玖尘壹埃贰渺叁漠',
      '壹又壹分貳釐參毫肆秒伍忽陸微柒纖捌沙玖塵壹埃貳渺參漠',
    ],
  ],
  [
    0.123456789123,
    [
      //
      '一分二厘三毫四秒五忽六微七纤八沙九尘一埃二渺三漠',
      '一分二釐三毫四秒五忽六微七纖八沙九塵一埃二渺三漠',
      '壹分贰厘叁毫肆秒伍忽陆微柒纤捌沙玖尘壹埃贰渺叁漠',
      '壹分貳釐參毫肆秒伍忽陸微柒纖捌沙玖塵壹埃貳渺參漠',
    ],
  ],
  [
    4971.123456789012,
    [
      //
      '四千九百七十一又一分二厘三毫四秒五忽六微七纤八沙九尘一渺二漠',
      '四千九百七十一又一分二釐三毫四秒五忽六微七纖八沙九塵一渺二漠',
      '肆仟玖佰柒拾壹又壹分贰厘叁毫肆秒伍忽陆微柒纤捌沙玖尘壹渺贰漠',
      '肆仟玖佰柒拾壹又壹分貳釐參毫肆秒伍忽陸微柒纖捌沙玖塵壹渺貳漠',
    ],
  ],
];
