/* eslint-disable prettier/prettier */
export const data: [number, string[]][] = [
  [10000001, ['一千万零一', '一千萬零一', '壹仟萬零壹', '壹仟萬零壹']],
  [10300000, ['一千零三十万', '一千零三十萬', '壹仟零叁拾萬', '壹仟零參拾萬']],
  [10200201, ['一千零二十万零二百零一', '一千零二十萬零二百零一', '壹仟零贰拾萬零贰佰零壹', '壹仟零貳拾萬零貳佰零壹']],
  [20034005, ['二千零三万四千零五', '二千零三萬四千零五', '贰仟零叁萬肆仟零伍', '貳仟零參萬肆仟零伍']],
  [23004500, ['二千三百万四千五百', '二千三百萬四千五百', '贰仟叁佰萬肆仟伍佰', '貳仟參佰萬肆仟伍佰']],
  [43033039, ['四千三百零三万三千零三十九', '四千三百零三萬三千零三十九', '肆仟叁佰零叁萬叁仟零叁拾玖', '肆仟參佰零參萬參仟零參拾玖']],
  [40333309, ['四千零三十三万三千三百零九', '四千零三十三萬三千三百零九', '肆仟零叁拾叁萬叁仟叁佰零玖', '肆仟零參拾參萬參仟參佰零玖']],
  [80000000, ['八千万', '八千萬', '捌仟萬', '捌仟萬']],
  [12345678, ['一千二百三十四万五千六百七十八', '一千二百三十四萬五千六百七十八', '壹仟贰佰叁拾肆萬伍仟陆佰柒拾捌', '壹仟貳佰參拾肆萬伍仟陸佰柒拾捌']],
  [99999999, ['九千九百九十九万九千九百九十九', '九千九百九十九萬九千九百九十九', '玖仟玖佰玖拾玖萬玖仟玖佰玖拾玖', '玖仟玖佰玖拾玖萬玖仟玖佰玖拾玖']],
];
