export const data: [number, string[]][] = [
  [100, ['一百', '壹佰', '壹佰']],
  [200, ['二百', '贰佰', '貳佰']],
  [205, ['二百零五', '贰佰零伍', '貳佰零伍']],
  [808, ['八百零八', '捌佰零捌', '捌佰零捌']],
  [290, ['二百九十', '贰佰玖拾', '貳佰玖拾']],
  [391, ['三百九十一', '叁佰玖拾壹', '參佰玖拾壹']],
  [492, ['四百九十二', '肆佰玖拾贰', '肆佰玖拾貳']],
  [111, ['一百一十一', '壹佰壹拾壹', '壹佰壹拾壹']],
  [222, ['二百二十二', '贰佰贰拾贰', '貳佰貳拾貳']],
  [333, ['三百三十三', '叁佰叁拾叁', '參佰參拾參']],
  [444, ['四百四十四', '肆佰肆拾肆', '肆佰肆拾肆']],
  [555, ['五百五十五', '伍佰伍拾伍', '伍佰伍拾伍']],
  [666, ['六百六十六', '陆佰陆拾陆', '陸佰陸拾陸']],
  [777, ['七百七十七', '柒佰柒拾柒', '柒佰柒拾柒']],
  [888, ['八百八十八', '捌佰捌拾捌', '捌佰捌拾捌']],
  [999, ['九百九十九', '玖佰玖拾玖', '玖佰玖拾玖']],
];

export const NEGATIVE = {
  SIMPLIFIED: '负',
  TRADITIONAL: '負',
};
export const POSITIVE = '正';
