import {convertNumber} from '../main/index';

test.each([
  [-130_0000, '负一百三十万'],
  [-2003_4005, '负二千零三万四千零五'],
  [-8000_0000, '负八千万'],
  [-1234_5678, '负一千二百三十四万五千六百七十八'],
  [-9999_9999, '负九千九百九十九万九千九百九十九'],
  [-1_0000_0000, '负一亿'],
  [-1_0205_5070, '负一亿零二百零五万五千零七十'],
  [-700_0000_0000, '负七百亿'],
  [-9876_1234_5678, '负九千八百七十六亿一千二百三十四万五千六百七十八'],
  [-9999_9999_9999, '负九千九百九十九亿九千九百九十九万九千九百九十九'],
  [-1_0000_0000_0000, '负一兆'],
  [
    -9007_1992_5474_0991,
    '负九千零七兆一千九百九十二亿五千四百七十四万零九百九十一',
  ],
])('negative numbers - default', (input: number, expected: string) => {
  expect(convertNumber(input)).toBe(expected);
});
test.each([
  [-130_0000, '负一百三十万'],
  [-2003_4005, '负二千零三万四千零五'],
  [-8000_0000, '负八千万'],
  [-1234_5678, '负一千二百三十四万五千六百七十八'],
  [-9999_9999, '负九千九百九十九万九千九百九十九'],
  [-1_0000_0000, '负一亿'],
  [-1_0205_5070, '负一亿零二百零五万五千零七十'],
  [-700_0000_0000, '负七百亿'],
  [-9876_1234_5678, '负九千八百七十六亿一千二百三十四万五千六百七十八'],
  [-9999_9999_9999, '负九千九百九十九亿九千九百九十九万九千九百九十九'],
  [-1_0000_0000_0000, '负一兆'],
  [
    -9007_1992_5474_0991,
    '负九千零七兆一千九百九十二亿五千四百七十四万零九百九十一',
  ],
])('negative numbers - simplified', (input: number, expected: string) => {
  expect(convertNumber(input, {useTraditional: false})).toBe(expected);
});

test.each([
  [-130_0000, '負一百三十萬'],
  [-2003_4005, '負二千零三萬四千零五'],
  [-8000_0000, '負八千萬'],
  [-1234_5678, '負一千二百三十四萬五千六百七十八'],
  [-9999_9999, '負九千九百九十九萬九千九百九十九'],
  [-1_0000_0000, '負一億'],
  [-1_0205_5070, '負一億零二百零五萬五千零七十'],
  [-700_0000_0000, '負七百億'],
  [-9876_1234_5678, '負九千八百七十六億一千二百三十四萬五千六百七十八'],
  [-9999_9999_9999, '負九千九百九十九億九千九百九十九萬九千九百九十九'],
  [-1_0000_0000_0000, '負一兆'],
  [
    -9007_1992_5474_0991,
    '負九千零七兆一千九百九十二億五千四百七十四萬零九百九十一',
  ],
])('negative numbers - traditional', (input: number, expected: string) => {
  expect(convertNumber(input, {useTraditional: true})).toBe(expected);
});
